[
  {
    "scholarship_id": "SCH001",
    "title": "STEM Excellence Scholarship",
    "sponsor": "TechNova Foundation",
    "description": "Awarded to high-achieving undergraduate students in science, technology, engineering, or mathematics, this scholarship recognizes exceptional academic and leadership capabilities in STEM. Candidates should demonstrate strong performance and innovation.",
    "description_long": "The STEM Excellence Scholarship recognizes high-achieving undergraduate students pursuing degrees in science, technology, engineering, or mathematics. Sponsored by the TechNova Foundation, this award supports individuals who show strong academic performance, innovative thinking, and leadership in STEM. The scholarship aims to foster talent that will shape the future of technology and research through their dedication and problem-solving skills.",
    "deadline": "2025-06-10",
    "amount": "$5,000",
    "eligibility": "Undergraduate STEM majors",
    "location": "USA",
    "tags": ["STEM", "Merit"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH002",
    "title": "Future Leaders Grant",
    "sponsor": "Global Initiatives",
    "description": "This grant supports outstanding high school seniors showing potential in leadership across all disciplines. Applicants must demonstrate initiative, vision, and a drive to lead their communities or fields of interest.",
    "description_long": "The Future Leaders Grant empowers high school seniors who demonstrate strong leadership potential across any discipline. Offered by Global Initiatives, this scholarship encourages young change-makers to pursue higher education and become influential voices in their communities. Applicants must showcase leadership roles, extracurricular involvement, and a clear vision for contributing positively to society. This grant helps students grow into effective, ethical leaders.",
    "deadline": "2025-06-11",
    "amount": "$3,000",
    "eligibility": "High school seniors",
    "location": "Global",
    "tags": ["Leadership", "Merit"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH003",
    "title": "Women in Tech Award",
    "sponsor": "CodeForge",
    "description": "Aimed at empowering women in the tech industry, this award supports female students passionate about technology. Ideal candidates are enrolled in computer science or related programs and show commitment to innovation.",
    "description_long": "The Women in Tech Award by CodeForge is designed to support and empower women pursuing degrees and careers in technology. This scholarship acknowledges the need for gender diversity in tech and supports students who demonstrate both academic excellence and a passion for innovation. Applicants should be actively involved in tech-related activities and committed to breaking barriers in the tech industry.",
    "deadline": "2025-06-12",
    "amount": "$4,000",
    "eligibility": "Women in tech",
    "location": "USA",
    "tags": ["Women", "Tech"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH004",
    "title": "Creative Arts Fellowship",
    "sponsor": "DesignHive Arts",
    "description": "This fellowship supports students in visual arts, performing arts, or creative writing. It honors creativity and originality and is ideal for artists who use their talents to express impactful messages.",
    "description_long": "The Creative Arts Fellowship by DesignHive Arts supports talented students in fields such as visual arts, performing arts, and creative writing. This scholarship encourages originality, expression, and dedication to the creative process. Candidates should demonstrate artistic skill, commitment to their craft, and a vision for how their art can impact audiences or communities. It’s ideal for those shaping the future of the arts.",
    "deadline": "2025-06-13",
    "amount": "$2,500",
    "eligibility": "Arts students",
    "location": "USA",
    "tags": ["Arts", "Creative"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH005",
    "title": "Data Science Scholarship",
    "sponsor": "DataNest",
    "description": "Open to graduate students in data science or analytics, this scholarship supports advanced studies in big data, machine learning, and data-driven decision-making to address real-world challenges.",
    "description_long": "The Data Science Scholarship, sponsored by DataNest, is offered to graduate students studying data science, statistics, or analytics. It supports students who use data to solve real-world problems and who demonstrate strong programming and analytical abilities. This scholarship seeks to advance research and innovation in the data science field, encouraging students to explore new frontiers in data-driven technologies and methodologies.",
    "deadline": "2025-06-14",
    "amount": "$5,500",
    "eligibility": "Graduate students",
    "location": "Canada",
    "tags": ["Data Science", "Graduate"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH006",
    "title": "Green Future Award",
    "sponsor": "EcoBridge",
    "description": "Designed for students committed to environmental sustainability, this scholarship supports eco-initiatives and education in environmental science, green technology, or sustainability practices.",
    "description_long": "The Green Future Award by EcoBridge is for environmentally conscious students who are pursuing studies in environmental science, sustainability, or related fields. This scholarship recognizes the importance of sustainability in today’s world and supports those committed to protecting the planet through science, activism, or innovation. Applicants should exhibit passion for eco-friendly initiatives and a desire to lead green projects or research.",
    "deadline": "2025-06-15",
    "amount": "$3,200",
    "eligibility": "Environmental majors",
    "location": "USA",
    "tags": ["Environment", "Sustainability"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH007",
    "title": "Mobile Innovator Grant",
    "sponsor": "AppRocket",
    "description": "This grant helps student developers focused on creating mobile apps that solve problems, enhance productivity, or offer unique digital experiences. Creativity and practical impact are key selection criteria.",
    "description_long": "The Mobile Innovator Grant from AppRocket is for students who show promise in mobile application development. This scholarship encourages innovation, usability, and problem-solving through mobile platforms. Candidates should have experience building mobile apps, either independently or through coursework, and a passion for enhancing digital experiences. It supports those who want to impact the world through smart and accessible mobile technologies.",
    "deadline": "2025-06-16",
    "amount": "$3,000",
    "eligibility": "App dev students",
    "location": "Global",
    "tags": ["Mobile", "Innovation"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH008",
    "title": "Project Management Grant",
    "sponsor": "VisionFlow",
    "description": "Supports business students focused on project planning and coordination. Applicants should show leadership potential, organizational ability, and familiarity with management tools and strategies.",
    "description_long": "The Project Management Grant, provided by VisionFlow, supports business students with a focus on project planning, coordination, and execution. It is designed for individuals who demonstrate strong leadership, organizational skills, and an understanding of agile or traditional project methodologies. This grant helps equip students with tools to manage teams, timelines, and goals efficiently in business and technical settings.",
    "deadline": "2025-06-17",
    "amount": "$2,000",
    "eligibility": "Business students",
    "location": "USA",
    "tags": ["Business", "Project Management"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH009",
    "title": "Cyber Defense Scholarship",
    "sponsor": "SecureNet",
    "description": "This award targets students in cybersecurity who are committed to protecting information systems. Applicants should show knowledge of network security, cryptography, and digital forensics.",
    "description_long": "The Cyber Defense Scholarship from SecureNet supports students studying cybersecurity or information security. This scholarship is designed for future professionals dedicated to safeguarding digital infrastructure and protecting against cyber threats. Ideal candidates demonstrate an understanding of risk management, ethical hacking, and information assurance. SecureNet aims to empower students who will become defenders of tomorrow’s data and networks.",
    "deadline": "2025-06-18",
    "amount": "$4,200",
    "eligibility": "Cybersecurity majors",
    "location": "USA",
    "tags": ["Cybersecurity"],
    "posted_on": "2025-04-21"
  },
  {
    "scholarship_id": "SCH010",
    "title": "AI Research Fund",
    "sponsor": "BrainWaveAI",
    "description": "This fund supports PhD students engaged in artificial intelligence research. Topics may include machine learning, robotics, NLP, and related fields focused on advancing AI capabilities.",
    "description_long": "The AI Research Fund by BrainWaveAI supports PhD students conducting research in artificial intelligence. It is tailored to those working on machine learning, natural language processing, robotics, or cognitive computing. The fund aims to accelerate groundbreaking AI research and encourage academic collaboration and innovation. Applicants must demonstrate strong academic credentials and a well-outlined research proposal with real-world impact.",
    "deadline": "2025-06-19",
    "amount": "$6,000",
    "eligibility": "PhD students",
    "location": "USA",
    "tags": ["AI", "Research"],
    "posted_on": "2025-04-21"
  },
  {
      "scholarship_id": "SCH011",
      "title": "Healthcare Heroes Scholarship",
      "sponsor": "MedicoTrust",
      "description": "For students pursuing careers in healthcare or public health, this scholarship recognizes commitment to community care, innovation in health services, and academic excellence in the medical field.",
      "description_long": "The Healthcare Heroes Scholarship, offered by MedicoTrust, is dedicated to students in nursing, medicine, or public health programs who aim to improve lives through healthcare. This award supports individuals with academic strength, compassion, and a dedication to service. It encourages the next generation of healthcare professionals to lead innovations and provide patient-focused care in their communities.",
      "deadline": "2025-06-20",
      "amount": "$4,500",
      "eligibility": "Healthcare students",
      "location": "USA",
      "tags": ["Health", "Public Health"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH012",
      "title": "Education for All Grant",
      "sponsor": "BrightClass",
      "description": "Supports aspiring teachers and educators working to promote inclusive, accessible, and quality education. Candidates should show dedication to improving educational outcomes for underprivileged communities.",
      "description_long": "The Education for All Grant, sponsored by BrightClass, backs future teachers, educators, or education reformers who are committed to equity in learning. This scholarship supports those championing inclusive education and innovative teaching methods. Applicants should demonstrate a clear mission to enhance learning environments, particularly for marginalized groups, and to drive meaningful change in educational systems.",
      "deadline": "2025-06-21",
      "amount": "$3,000",
      "eligibility": "Education majors",
      "location": "Global",
      "tags": ["Education", "Equity"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH013",
      "title": "Global Explorer Scholarship",
      "sponsor": "WorldBound",
      "description": "For students who seek to broaden their horizons through international study. The scholarship supports academic travel, exchange programs, or global research projects that foster cross-cultural understanding.",
      "description_long": "The Global Explorer Scholarship by WorldBound empowers students who aim to study abroad, participate in international exchanges, or conduct global research. This award promotes cultural exchange and intellectual growth through international experiences. Applicants should present strong academic records and a compelling reason for engaging in global learning that connects with their educational or career goals.",
      "deadline": "2025-06-22",
      "amount": "$3,500",
      "eligibility": "Study abroad students",
      "location": "Global",
      "tags": ["International", "Cultural Exchange"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH014",
      "title": "Inclusive Tech Scholarship",
      "sponsor": "EqualByte",
      "description": "This scholarship supports students from underrepresented backgrounds in computer science and tech fields. It aims to diversify the technology workforce and foster inclusive innovation.",
      "description_long": "The Inclusive Tech Scholarship by EqualByte is awarded to students from marginalized communities who are studying computer science or related tech fields. This scholarship promotes diversity and representation in the tech industry by supporting students who face systemic barriers. Recipients are selected based on academic merit, financial need, and their potential to contribute to inclusive innovation.",
      "deadline": "2025-06-23",
      "amount": "$4,000",
      "eligibility": "Underrepresented students in tech",
      "location": "USA",
      "tags": ["Diversity", "Tech"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH015",
      "title": "Agriculture Impact Grant",
      "sponsor": "FarmRoots Foundation",
      "description": "Offered to students in agricultural sciences, this grant supports research and innovations that address global food security, sustainable farming, or agri-tech development.",
      "description_long": "The Agriculture Impact Grant from FarmRoots Foundation supports students pursuing degrees in agricultural sciences or related areas. The scholarship encourages work in sustainable agriculture, food systems, or technology-driven farming. Applicants should be focused on solving agricultural challenges, whether through research, policy development, or innovation that helps ensure global food security and environmental stewardship.",
      "deadline": "2025-06-24",
      "amount": "$3,800",
      "eligibility": "Agriculture students",
      "location": "USA",
      "tags": ["Agriculture", "Sustainability"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH016",
      "title": "Digital Creator Award",
      "sponsor": "StreamLabs",
      "description": "Aimed at content creators, this award recognizes students producing educational, entertaining, or socially conscious content across digital platforms including YouTube, TikTok, or podcasts.",
      "description_long": "The Digital Creator Award by StreamLabs celebrates student content creators who use platforms like YouTube, TikTok, Instagram, or podcasting to educate, entertain, or promote social change. Applicants should provide samples of original content and articulate their creative vision. This scholarship supports young digital storytellers shaping the future of online media with originality and purpose.",
      "deadline": "2025-06-25",
      "amount": "$2,800",
      "eligibility": "Content creators",
      "location": "Global",
      "tags": ["Media", "Digital"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH017",
      "title": "Finance Leaders Scholarship",
      "sponsor": "FinServe",
      "description": "This scholarship supports students majoring in finance, economics, or accounting. It seeks future financial leaders who demonstrate integrity, analytical skill, and commitment to ethical business.",
      "description_long": "The Finance Leaders Scholarship, funded by FinServe, is awarded to students pursuing finance, economics, or accounting degrees. This scholarship rewards academic excellence, leadership potential, and ethical thinking in the financial sector. Ideal applicants are those who wish to lead with integrity, drive fiscal innovation, or contribute to economic policy and sustainable business practices.",
      "deadline": "2025-06-26",
      "amount": "$3,600",
      "eligibility": "Finance students",
      "location": "USA",
      "tags": ["Finance", "Economics"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH018",
      "title": "Accessibility Innovator Grant",
      "sponsor": "OpenAccess Initiative",
      "description": "For students developing tools, technologies, or strategies that improve accessibility for people with disabilities. The scholarship promotes inclusive design and universal access.",
      "description_long": "The Accessibility Innovator Grant from OpenAccess Initiative supports students creating solutions for people with disabilities. Whether through assistive technologies, accessible software, or universal design, this scholarship honors innovation that bridges access gaps. Applicants should demonstrate a user-first approach, empathy, and technical or policy-based solutions that improve lives and expand opportunities for all.",
      "deadline": "2025-06-27",
      "amount": "$4,400",
      "eligibility": "Accessibility-focused students",
      "location": "Global",
      "tags": ["Accessibility", "Innovation"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH019",
      "title": "Law & Justice Award",
      "sponsor": "LegalPath",
      "description": "This award is for students committed to justice, legal reform, or public interest law. Applicants should show passion for using the law to make a difference in society.",
      "description_long": "The Law & Justice Award, sponsored by LegalPath, supports students in pre-law, law school, or related legal studies who want to use the law to promote justice and equity. Applicants should demonstrate advocacy experience, public service goals, or a track record of community engagement. The award empowers future legal professionals who strive to make legal systems fairer and more inclusive.",
      "deadline": "2025-06-28",
      "amount": "$4,100",
      "eligibility": "Law students",
      "location": "USA",
      "tags": ["Law", "Justice"],
      "posted_on": "2025-04-21"
    },
    {
      "scholarship_id": "SCH020",
      "title": "Rural Tech Access Scholarship",
      "sponsor": "ConnectRural",
      "description": "This scholarship helps rural students access STEM education and resources. It supports learners working to bridge digital divides and promote tech literacy in rural communities.",
      "description_long": "The Rural Tech Access Scholarship by ConnectRural supports students from rural backgrounds who are studying STEM or digital literacy. It encourages efforts to close the digital divide by empowering students who wish to bring innovation, access, and opportunity to underserved communities. Applicants should show academic promise, community involvement, and a commitment to using tech to improve rural life.",
      "deadline": "2025-06-29",
      "amount": "$3,300",
      "eligibility": "Rural STEM students",
      "location": "USA",
      "tags": ["Rural", "STEM"],
      "posted_on": "2025-04-21"
    }
  
  
]
